Feature: ѕолучение информацию о времени отклика разработчика на тестирование задач.

  Scenario: јвторизованный пользователь получает информацию о времени отклика разработчика на тестирование задач за период.
    Given јвторизованный пользователь может указывает период, за который требуетс€ посчитать врем€ отклика
    When ѕроисходит запрос
    Then ƒанные дл€ расчета извлекаютс€ из отслеживаемых репозиториев.
    Then ƒанные визуализируютс€ при помощи линейного графика "врем€-врем€ отклика".

  Scenario: јвторизованный пользователь получает информацию о времени отклика разработчика на тестирование задач за период.
    When ѕроисходит запрос
    Then ƒанные дл€ расчета извлекаютс€ из отслеживаемых репозиториев.
    Then ƒанные визуализируютс€ при помощи линейного графика "врем€-врем€ отклика".