Feature: ѕолучение информации о количестве активных дней разработчика за период

  Scenario: јвторизованный пользователь получает информацию о количестве активных дней разработчика за период
    Given ѕользователь указывает период, за который требуетс€ посчитать количество активных дней
    When ѕроисходит запрос
    Then ƒанные дл€ расчета количества активных дней извлекаютс€ из отслеживаемых репозиториев
    Then ƒанные визуализируютс€ с помощью линейного графика "врем€-количество активных дней"

  Scenario: јвторизованный пользователь получает информацию о количестве активных дней разработчика   
    When ѕроисходит запрос
    Then ƒанные дл€ расчета количества активных дней извлекаютс€ из отслеживаемых репозиториев
    Then ƒанные визуализируютс€ с помощью линейного графика "врем€-количество активных дней"