Feature: Получение информации о churn кода разработчика

  Scenario: Авторизованный пользователь получает информацию о churn кода за период.
    Given Пользователь указывает период.
    When Происходит запрос
    Then Данные для расчета churn извлекаются из отслеживаемых репозиториев.
    Then Данные визуализируются с помощью линейного графика "время-churn"
    
  Scenario: Авторизованный пользователь получает информацию о churn кода за период.
    When Происходит запрос
    Then Данные для расчета churn извлекаются из отслеживаемых репозиториев.
    Then Данные визуализируются с помощью линейного графика "время-churn"