Feature: ѕолучение информации об объеме кода

  Scenario: јвторизованный пользователь получает информацию о количестве строк кода, которые он закоммитил в рабочее/нерабочее врем€ за период.
    Given ѕользователь указывает период, за который требуетс€ посчитать количество закоммиченных строк кода.
    When ѕроисходит запрос
    Then ƒанные дл€ расчета количества закоммиченных строк извлекаютс€ из отслеживаемых репозиториев.
    Then ƒанные визуализируютс€ при помощи двух линейных графиков "врем€-количество строк" на одном поле
    
  Scenario: јвторизованный пользователь получает информацию о количестве строк кода, которые он закоммитил в рабочее/нерабочее врем€.   
    When ѕроисходит запрос
    Then ƒанные дл€ расчета количества закоммиченных строк извлекаютс€ из отслеживаемых репозиториев.
    Then ƒанные визуализируютс€ при помощи двух линейных графиков "врем€-количество строк" на одном поле